Revit 2026 API

# ParameterTypeIdBoundaryRestraintRotX Property

---

"X Spring Modulus"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId BoundaryRestraintRotX { get; }
```
```vb
Public Shared ReadOnly Property BoundaryRestraintRotX As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ BoundaryRestraintRotX {
	ForgeTypeId^ get ();
}
```
```fsharp
static member BoundaryRestraintRotX : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace